{
  "backend/main.mo": "Motoko actor defining the backend for a decentralized desktop OS, managing app entries (add/get) and a rich Settings record (accent color, wallpaper, font size, UI effects, etc.) with query/update methods.",
  "feature_evidence.json": "Feature evidence report linking a single high-confidence feature (full codebase re-apply/verification) to its relevant frontend files, component dependencies, and test ID REQ-1.",
  "frontend-file-summaries.txt": "JSON map of short per-file summaries for all frontend source files, serving as a quick reference for what each module does and notable implementation decisions (e.g., string literal casts for missing enum imports).",
  "frontend/index.css": "Tailwind base CSS file defining OKLCH-based CSS custom properties for light and dark themes covering background, foreground, chart, sidebar, and other design tokens.",
  "frontend/index.html": "HTML entry point loading Orbitron and Share Tech Mono fonts from Google Fonts, setting a dark overflow-hidden viewport, and mounting the React app with the ZERO-OS title and logo favicon.",
  "frontend/src/App.tsx": "Root React component that renders the Desktop alongside a dark-themed Sonner Toaster styled with neon cyan OKLCH colors and Share Tech Mono font.",
  "frontend/src/components/AddAppDialog.tsx": "Modal dialog component for installing new apps, handling name/URL inputs with normalization, calling the addApp backend mutation, and displaying neon cyberpunk styling with success/error toasts.",
  "frontend/src/components/AppIcon.tsx": "Desktop app icon button that loads a site favicon, shows a fallback initial letter, scales by iconSize setting, applies accent-color neon glow on hover, and displays an open/minimized indicator dot.",
  "frontend/src/components/Desktop.tsx": "Full-screen OS desktop component composing Wallpaper, ParticleEffect, app icons grid, floating Windows, Taskbar, SettingsPanel, and AddAppDialog, with window open/close/minimize/focus state management.",
  "frontend/src/components/ParticleEffect.tsx": "Renders an animated canvas-based particle effect with configurable intensity and accent color, supporting dot, orb, and streak particle types with fade-in/out lifecycle.",
  "frontend/src/components/PinDialog.tsx": "Modal dialog that prompts the user for a PIN with a password input, cancel/confirm buttons, and optional error message display.",
  "frontend/src/components/SettingsPanel.tsx": "Multi-section settings panel for customizing appearance, typography, effects, clock, taskbar, wallpaper, and system options, with PIN-protected wallpaper changes and save functionality.",
  "frontend/src/components/Taskbar.tsx": "Fixed bottom taskbar displaying open windows, a live clock, settings button, and add-app button, with configurable height, clock format, and accent color theming.",
  "frontend/src/components/Wallpaper.tsx": "Renders a full-screen background wallpaper as either a looping video (for .mp4 URLs) or a static image, falling back to a default asset.",
  "frontend/src/components/Window.tsx": "Draggable, maximizable floating window component that embeds a URL in an iframe, with configurable transparency, border glow, and accent color styling.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and caches an Internet Computer actor (authenticated or anonymous) based on the current identity, invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and hook for Internet Identity authentication on the ICP platform, managing login state, identity persistence, and AuthClient lifecycle.",
  "frontend/src/hooks/useQueries.ts": "Defines TanStack Query hooks for fetching and mutating apps and settings via the backend actor, with app IDs persisted in localStorage.",
  "frontend/src/hooks/useSettings.ts": "Thin wrapper around useGetSettings that exposes the current Settings object and loading state.",
  "frontend/src/index.css": "Global CSS for the neon/futuristic OS UI, defining CSS custom properties for the color system, Tailwind imports, scanline/grid overlay effects, and scrollbar utilities.",
  "frontend/src/main.tsx": "React app entry point that mounts the root component wrapped with QueryClientProvider and InternetIdentityProvider.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the theme with neon colors, surface layers, Orbitron/Share Tech Mono fonts, neon box shadows, and animation keyframes.",
  "project_state.json": "Project state metadata file tracking schema version, existing features, and deployment fix request to ensure the live app reflects the latest codebase."
}