{
  "backend/main.mo": "Motoko actor defining the backend for a desktop OS app, managing app entries, UI settings (accent color, wallpaper, effects, etc.), and video settings with CRUD endpoints.",
  "feature_evidence.json": "JSON report mapping implemented features (Settings window, MP4 wallpaper upload, app persistence) to their relevant source files, components, test IDs, and confidence levels.",
  "frontend-file-summaries.txt": "JSON object providing one-line descriptions of each frontend source file, serving as a quick reference for the purpose and key behavior of every component, hook, and config file.",
  "frontend/index.css": "Global CSS file defining Tailwind base styles and OKLCH-based CSS custom properties for light and dark themes used throughout the UI.",
  "frontend/index.html": "HTML entry point for the Zero OS frontend, loading Orbitron and Share Tech Mono fonts from Google Fonts and mounting the React app at the root div.",
  "frontend/src/App.tsx": "Root React component that renders the Desktop and a dark-themed Sonner toast notification provider.",
  "frontend/src/components/AddAppDialog.tsx": "Modal dialog component for installing new apps by name and URL, calling the backend addApp mutation and showing success or error toasts before closing.",
  "frontend/src/components/AppIcon.tsx": "Desktop app icon component with emoji-based icons, hover effects, click-to-open behavior, and a right-click context menu for removing non-built-in apps.",
  "frontend/src/components/Desktop.tsx": "Main desktop component that manages open windows, app icons, taskbar, wallpaper, and settings, composing all major UI pieces together with state for window z-ordering, minimization, and app lifecycle.",
  "frontend/src/components/ParticleEffect.tsx": "Canvas-based animated particle effect component rendering dots, orbs, and streaks with configurable intensity levels (off/low/medium/high) using requestAnimationFrame.",
  "frontend/src/components/PinDialog.tsx": "Modal PIN entry dialog with a cyberpunk aesthetic used to gate wallpaper changes, supporting error display, keyboard escape cancellation, and form submission.",
  "frontend/src/components/SettingsPanel.tsx": "Multi-section settings panel for configuring appearance, wallpaper (including video upload with progress), desktop, taskbar, effects, clock, and apps, with PIN-protected wallpaper changes.",
  "frontend/src/components/Taskbar.tsx": "Fixed bottom taskbar component displaying open apps, a live clock (12/24h), an add-app button, and a settings button, with configurable height and accent color theming.",
  "frontend/src/components/Wallpaper.tsx": "Fullscreen wallpaper component that renders either a static image or a looping video (with muted fallback for autoplay policy) based on the provided URL.",
  "frontend/src/components/Window.tsx": "A draggable, resizable browser window component with minimize/maximize/close controls, supporting configurable border glow and UI transparency/blur effects.",
  "frontend/src/hooks/useActor.ts": "A React Query hook that creates and caches an ICP actor (authenticated or anonymous) based on the current Internet Identity, invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an Internet Identity authentication context and provider using DFINITY's AuthClient, exposing login/logout functions and identity/status state to child components.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for managing apps (CRUD via localStorage and optional backend) and user settings (fetched from the ICP backend actor), including a wallpaper video upload mutation.",
  "frontend/src/hooks/useSettings.ts": "A thin wrapper around useGetSettings that re-exports the query result with the data typed as Settings.",
  "frontend/src/index.css": "Global Tailwind CSS stylesheet defining CSS custom properties for a dark neon OS theme, along with utility classes for glow effects, scanlines, backdrop blur levels, and taskbar/icon sizing.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app wrapped with QueryClientProvider and InternetIdentityProvider.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the default theme with neon/OS color palettes, custom fonts (Orbitron, Share Tech Mono), border radii, box shadows, and plugins for typography, container queries, and animations.",
  "project_state.json": "Tracks the current state of the Zero OS project including version, feature list, architectural notes, and known issues. Serves as a planning/documentation artifact describing a Windows-inspired futuristic neon OS-styled website."
}