{
  "kind": "build_request",
  "title": "Fix deployment — ensure latest changes are reflected in live app",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Verify and re-apply all existing frontend and backend source files so that the deployed application reflects the current codebase state, including the expanded settings panel, redesigned taskbar, neon futuristic styling, particle effects, wallpaper support, and all other implemented features documented in feature_evidence.json.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-5"
        ],
        "quotes": [
          "But nothing changed"
        ]
      },
      "acceptanceCriteria": [
        "The live preview shows the neon/cyberpunk OS-style desktop UI with Taskbar, AppIcons, Windows, SettingsPanel, and Wallpaper components rendered correctly.",
        "The expanded settings panel (appearance, typography, effects, clock, taskbar, wallpaper sections) is accessible and functional.",
        "The bottom taskbar displays the live clock, open window buttons, add-app button, and settings button.",
        "Particle effects render on the desktop canvas when enabled.",
        "App icons render with favicon, glow effects, and correct sizing from settings.",
        "Backend endpoints for adding/getting apps and saving/getting settings respond correctly.",
        "No visual regressions from the previously described Version 3 state."
      ]
    }
  ],
  "constraints": [
    "Do not alter immutable frontend paths: frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, frontend/src/components/ui.",
    "Preserve single-actor Motoko backend architecture in backend/main.mo.",
    "Do not introduce new features — this is a fix/re-deploy only."
  ],
  "nonGoals": [
    "Adding new features or UI elements not already implemented.",
    "Changing the design language or theme.",
    "Modifying the migration logic unless a schema change is required."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}