{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Fix deployment — ensure latest changes are reflected in live app",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Verify and re-apply all existing frontend source files so that the deployed application reflects the current codebase state, including the expanded settings panel, redesigned taskbar, neon futuristic styling, particle effects, wallpaper support, and all other implemented features.",
      "acceptanceCriteria": [
        "The live preview shows the neon/cyberpunk OS-style desktop UI with Taskbar, AppIcons, Windows, SettingsPanel, and Wallpaper components rendered correctly.",
        "The expanded settings panel (appearance, typography, effects, clock, taskbar, wallpaper sections) is accessible and functional.",
        "The bottom taskbar displays the live clock, open window buttons, add-app button, and settings button.",
        "Particle effects render on the desktop canvas when enabled.",
        "App icons render with favicon, glow effects, and correct sizing from settings.",
        "Backend endpoints for adding/getting apps and saving/getting settings respond correctly.",
        "No visual regressions from the previously described Version 3 state."
      ],
      "file_operations": [
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Verify and re-apply the root React component that renders the Desktop alongside the dark-themed neon-styled Sonner toast notification provider. Ensure the component structure matches the current implementation with proper toast theming and Desktop rendering."
        },
        {
          "path": "frontend/src/components/Desktop.tsx",
          "operation": "modify",
          "description": "Verify and re-apply the main desktop component that composes the full OS-like UI, managing open windows, z-index stacking, and rendering Wallpaper, ParticleEffect, Taskbar, AppIcons, Windows, SettingsPanel, and AddAppDialog with settings-driven overlays. Ensure all component compositions and state management logic are current."
        },
        {
          "path": "frontend/src/components/Taskbar.tsx",
          "operation": "modify",
          "description": "Verify and re-apply the fixed bottom taskbar component displaying a live clock, open window buttons with minimize/restore, an add-app button, and a settings button, with height configurable via settings. Ensure the clock format, window controls, and button interactions match the current implementation."
        },
        {
          "path": "frontend/src/components/SettingsPanel.tsx",
          "operation": "modify",
          "description": "Verify and re-apply the sectioned settings panel (appearance, typography, effects, clock, taskbar, wallpaper, etc.) that reads and saves settings via React Query hooks, with PIN-protected wallpaper changes. Ensure all settings sections, controls, and PIN protection logic are current."
        },
        {
          "path": "frontend/src/components/Wallpaper.tsx",
          "operation": "modify",
          "description": "Verify and re-apply the desktop wallpaper component that renders either a full-screen looping video (for .mp4 URLs) or a static image, falling back to the default wallpaper asset (frontend/public/assets/generated/wallpaper.dim_1920x1080.png) when no URL is provided. Ensure video autoplay, loop, and fallback logic are correctly implemented."
        },
        {
          "path": "frontend/src/components/ParticleEffect.tsx",
          "operation": "modify",
          "description": "Verify and re-apply the canvas-based animated particle effect component that renders dots, orbs, and streaks with configurable intensity levels (off/low/medium/high). Ensure the canvas rendering, animation loop, and intensity-based particle generation match the current implementation."
        },
        {
          "path": "frontend/src/components/AppIcon.tsx",
          "operation": "modify",
          "description": "Verify and re-apply the desktop app icon component that renders a favicon, scales based on iconSize/fontSize settings, and applies neon hover glow effects with open/minimized state indicators. Ensure favicon loading, size scaling, and glow effects are correctly implemented."
        },
        {
          "path": "frontend/src/components/Window.tsx",
          "operation": "modify",
          "description": "Verify and re-apply the draggable, resizable browser window component with minimize/maximize/close controls that applies dynamic glow, blur, and background opacity styles based on settings. Ensure drag/resize interactions, window controls, and settings-driven styling are current."
        },
        {
          "path": "frontend/src/components/AddAppDialog.tsx",
          "operation": "modify",
          "description": "Verify and re-apply the modal dialog for installing new apps by entering a name and URL, with URL normalization, backend mutation via useAddApp, and neon futuristic styling. Ensure form validation, backend integration, and dialog styling match the current implementation."
        },
        {
          "path": "frontend/src/components/PinDialog.tsx",
          "operation": "modify",
          "description": "Verify and re-apply the modal PIN entry dialog with a cyberpunk aesthetic used to authenticate wallpaper changes, supporting error display and cancel/submit callbacks. Ensure PIN input handling, error states, and styling are current."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Verify and re-apply React Query hooks for fetching/mutating apps and settings from the backend actor, with default settings fallback values. Ensure query keys, mutations, and default values match the current implementation and backend interface types."
        },
        {
          "path": "frontend/src/hooks/useSettings.ts",
          "operation": "modify",
          "description": "Verify and re-apply the thin wrapper around useGetSettings that returns the settings data and loading state with typed output. Ensure the hook correctly exports settings and loading state."
        },
        {
          "path": "frontend/src/index.css",
          "operation": "modify",
          "description": "Verify and re-apply global CSS defining CSS custom properties for a dark neon OS theme, plus utility classes for glow effects, scanlines, backdrop blur levels, taskbar/icon sizes, and font variants. Ensure all custom properties, utility classes, and theme variables are current and match the neon/cyberpunk design system."
        },
        {
          "path": "frontend/tailwind.config.js",
          "operation": "modify",
          "description": "Verify and re-apply Tailwind CSS configuration extending the theme with neon/OS color palettes, custom fonts (Orbitron, Share Tech Mono), box shadows, border radii, and enabling typography, container-queries, and animate plugins. Ensure all color tokens, font families, and plugin configurations are current."
        },
        {
          "path": "frontend/index.html",
          "operation": "modify",
          "description": "Verify and re-apply the HTML entry point that preloads Orbitron and Share Tech Mono fonts from Google Fonts and mounts the React app root with overflow-hidden body styles. Ensure font preloading and body styles are correctly set."
        }
      ]
    }
  ]
}